Revit 2026 API

# TaskDialogEnableMarqueeProgressBar Property

---

Enables a marquee style progress bar to be displayed in the TaskDialog.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool EnableMarqueeProgressBar { get; set; }
```
```vb
Public Property EnableMarqueeProgressBar As Boolean
	Get
	Set
```
```cpp
public:
property bool EnableMarqueeProgressBar {
	bool get ();
	void set (bool value);
}
```
```fsharp
member EnableMarqueeProgressBar : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown if the TaskDialog also has ExtraCheckBoxText set as the two cannot coincide in the same TaskDialog. |

When true, the TaskDialog will display a progress bar that has an indeterminate start and stop.

A progress bar is a window that an application can use to indicate the progress of a lengthy operation.

It consists of a rectangle that is animated as an operation progresses. The animation continues until the TaskDialog is closed.

The default value is false.

#### Reference

TaskDialog Class

Autodesk.Revit.UI Namespace